content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section: ./posts
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+title: Forensic Wheels
#+seq_todo: DRAFT TODO DONE
#+FILETAGS: :forensicwheels:
#+TAGS: @personal @forensic @zen @threathunting
#+TAGS: openbsd honeypot zen personal canarytokens skateboarding visibility

#+startup: indent
#+author: Dirk

* DRAFT The unseen hero of OpenBSD, talking about OpenBSD's malloc                        :openbsd:
:PROPERTIES:
:EXPORT_AUTHOR: Dirk
:EXPORT_HUGO_FRONT_MATTER_FORMAT: yaml
:HUGO_TITLE: OpenBSD-malloc
:HUGO_MENU_TITLE: openbsdmalloc
:HUGO_CHAPTER: true
:HUGO_WEIGHT: 5
:EXPORT_FILE_NAME: openbsdmalloc
:EXPORT_DATE: 2025-12-09T08:48:00-05:00
:CUSTOM_ID: openbsdmalloc
:END:
** The unseen hero of OpenBSD: talking about OpenBSD's malloc

*** Introduction
When people talk about operating system security, they often mention firewalls,
cryptography, or privilege separation. But one of the most important security
components usually remains invisible: the memory allocator. On OpenBSD, the
default allocator—malloc—is not just an implementation detail. It reflects the
project’s long-standing commitment to robustness and safety. This article
explains, at a high level, why OpenBSD’s malloc is so unusual, so protective,
and so “unseen yet essential”.

*** Why the allocator matters
Every non-trivial program allocates memory dynamically. Buffer overflows,
use-after-free bugs, double frees, and integer overflows are among the most
common vulnerability classes discovered in C and C++ software. How an allocator
reacts to such mistakes—silently, or by crashing loudly—makes a huge difference
in the exploitability of bugs. OpenBSD’s malloc is designed to turn subtle bugs
into immediate, detectable failures rather than exploitable conditions.

*** A brief history of OpenBSD malloc

**** From early BSD roots to stronger isolation
OpenBSD originally inherited a BSD-family allocator with sbrk()-based heap
expansion. This traditional design grouped memory into one contiguous,
predictable region—efficient, but not ideal for security.

**** 2001: mmap everywhere
Thierry Deval rewrote malloc to use mmap() instead of sbrk(). This enabled
page-aligned allocations, fine-grained memory protection, and natural
integration with address-space randomization. It was the first major step
toward a modern, defensive allocator. Source: [[https://man.openbsd.org/OpenBSD-5.6/malloc.conf.5][malloc.conf(5)]]

**** 2008: The Otto Moerbeek rewrite
In 2008, Otto Moerbeek introduced a nearly complete redesign of malloc. This is
the allocator OpenBSD uses today. It emphasizes safety, randomness, metadata
integrity, and strong failure modes. It is often called “otto-malloc”. Source:
[[https://isopenbsdsecu.re/mitigations/malloc/][Summary of malloc evolution]]

*** Architectural principles of OpenBSD malloc
OpenBSD malloc is built on a set of design decisions that strongly influence its
security posture:

- mmap for everything: Allocations come from mmap’d regions, not a single heap.
  This creates natural separation, unpredictable placement, and eliminates many
  traditional heap-exploitation techniques.
- Randomized layout: Allocation sizes, reuse patterns, and chunk placement are
  randomized. Attackers cannot reliably predict where objects land in memory.
- Out-of-band metadata: Metadata is not stored next to user data. Classic heap
  attacks often rely on corrupting bookkeeping structures; here, that avenue is
  largely closed.
- Optional guard pages: Guard pages are unmapped pages placed around allocations.
  An overflow into a guard page triggers an immediate crash, revealing bugs early.
- Junk filling (memory poisoning): Freed memory can be filled with patterns that
  make use-after-free bugs fail loudly instead of silently corrupting memory.
- Free-unmap for larger allocations: Large allocations, when freed, can be returned
  directly to the kernel. Any subsequent access results in a crash, revealing
  use-after-free misuse.
- Fail fast philosophy: When inconsistencies are detected—corrupted metadata,
  impossible bounds, invalid free patterns—malloc aborts the process. While harsh,
  this approach removes ambiguity and eliminates entire classes of silent
  corruption bugs.

These features combine to create a defensive architecture that reduces the
predictability and exploitability of memory corruption issues.

*** A process-centric analogy: memory as isolated workspaces

**** The model we usually assume
Many developers implicitly imagine memory as a shared workspace inside a
process: one large area where objects are placed next to each other, managed by
a fast but trusting allocator. This mental model is close to how traditional
heaps work and explains why many memory bugs remain invisible for a long time.

**** The traditional allocator: shared desks in one open office
In a conventional allocator design, the process receives one large, contiguous
heap. Individual allocations are like desks in a single open office:

- Desks are adjacent.
- Bookkeeping notes are pinned directly to the desks.
- Moving past the edge of your desk means bumping into your neighbor’s space.

If a program writes past the end of an allocation, it usually lands in another
valid object. The program keeps running, but the logical state is now corrupted.
Exploitation thrives on this ambiguity.

**** The OpenBSD allocator: isolated workspaces with access control

OpenBSD’s malloc enforces a very different model.

Each allocation is treated as an isolated workspace:

- Backed by its own mmap()’d region
- Page-aligned and unpredictably placed
- Surrounded, when configured, by unmapped guard pages
- With metadata stored out-of-band

Instead of one shared office, the process now consists of many small, isolated
rooms. Some rooms are intentionally empty and inaccessible.

From the program’s perspective, nothing changes:

#+begin_src c
void *p = malloc(4096);
#+end_src

But the execution environment is fundamentally more hostile to mistakes.

**** Failure modes as design signals

***** Out-of-bounds writes
_Traditional allocator:_

- Writes land in a neighboring object
- Corruption propagates silently

_OpenBSD malloc:_

- Writes cross into an unmapped page
- The CPU raises a fault
- The process terminates immediately

***** Use-after-free
_Traditional allocator:_

- Freed memory is quickly reused
- Old pointers appear to “work”
- State corruption accumulates

_OpenBSD malloc:_
- Memory may be unmapped or junk-filled
- Old pointers reliably fault
- Bugs become reproducible

***** Metadata corruption
_Traditional allocator:_

- Metadata lives next to user data
- Overwrites alter allocator behavior

_OpenBSD malloc:_

- Metadata is inaccessible to user code
- Integrity checks fail fast
- The allocator aborts the process

**** Why this model matters
This design changes the economics of exploitation:

Objects are not laid out contiguously
Memory reuse is unpredictable
Metadata is unreachable
Undefined behavior collapses into defined failure

OpenBSD malloc does not attempt to mask programmer errors. Instead, it enforces a
strict contract: memory misuse results in immediate termination. For developers
and security engineers, this turns entire classes of heap bugs from latent
security risks into actionable crashes.

*** Guard Pages: Practical use and effects
One of OpenBSD malloc’s most notable security features is the use of **Guard
Pages**. Guard Pages are completely unmapped memory pages placed around an
allocation. Any read or write into these pages triggers an immediate
Segmentation Fault, making overflows or out-of-bounds accesses immediately
visible.

**** Enabling Guard Pages

HSet a systemwide reduction of the cache to a quarter of the default size
and use guard pages (man malloc):

#+begin_src
# sysctl vm.malloc_conf='G<<'
#+end_src

Other options include:

- `redzone`: Defines padding around small allocations to catch small overflows.
- `junk`: Determines whether freed memory is filled with junk to detect
  use-after-free errors.
- `jumbo`: Threshold for large allocations to be immediately `munmap()`’ed when
  freed.
- `alignment`: Adjusts alignment for allocations, useful for performance or
  hardware-specific requirements.

**** Effects on userland programs
1. **Increased memory usage:** Each allocation may require extra pages, increasing
   overall memory consumption.
2. **Immediate bug detection:** Buffer overflows or writes beyond allocated memory
   result in a crash rather than silent corruption.
3. **Compatibility considerations:** Programs that assume contiguous memory may
   crash unexpectedly with guard pages enabled.
4. **Debug vs. Production:** Guard Pages are typically enabled in debug builds and
   often disabled in production to conserve memory.

**** Example
A C program with a buffer overflow:

#+BEGIN_SRC c
char *buf = malloc(16);
buf[16] = 'x'; // off-by-one!
#+END_SRC

With guard pages, this immediately triggers a Segmentation Fault.

----

**** Furter mentionworthy OpenBSD malloc Options

OpenBSD's malloc provides several options to help detect common memory
errors such as use-after-free, buffer overflows, and double frees. These
options are configured system-wide via **sysctl vm.malloc_conf**.

***** Guard Pages (G)
- **Effect:** Places unmapped "guard pages" around larger allocations. Any
  access triggers an immediate segmentation fault.
- **Usage:**
#+BEGIN_SRC sh
# Enable guard pages
sysctl vm.malloc_conf='G'
#+END_SRC
- **Purpose:** Detects overflows and large out-of-bounds memory access
  immediately.

***** Junk Filling (J)
- **Effect:** Freed memory is filled with a recognizable pattern (0xAB),
  making use-after-free accesses immediately apparent.
- **Usage:**
#+BEGIN_SRC sh
sysctl vm.malloc_conf='J'
#+END_SRC
- **Purpose:** Makes use-after-free bugs crash or produce detectable
  corruption.

***** Redzones (R)
- **Effect:** Adds small padded areas around small allocations to catch
  off-by-one errors and small buffer overflows.
- **Usage:**
#+BEGIN_SRC sh
sysctl vm.malloc_conf='R'
#+END_SRC
- **Purpose:** Early detection of minor memory boundary violations.

***** Jumbo Free / Munmap (U)
- **Effect:** Large allocations exceeding the "jumbo" threshold are unmapped
  immediately on free. Any subsequent access causes an immediate crash.
- **Usage:**
#+BEGIN_SRC sh
sysctl vm.malloc_conf='U'
#+END_SRC
- **Purpose:** Detects use-after-free errors on large memory blocks.

***** Combining Flags
Flags can be combined to enable multiple safety mechanisms at once. Example:
#+BEGIN_SRC sh
# Enable Guard Pages, Junk Filling, and Redzones simultaneously
sysctl vm.malloc_conf='GJR'
#+END_SRC

***** Additional Useful Flags
- `C` → Enables malloc call statistics (useful for debugging/analysis)
- `<` / `>` → Adjusts cache size (trading memory footprint vs. performance)

***** Practical Tips
- For fuzzing or development, `GJR` is a strong combination to catch
  common memory errors early.
- In production, consider enabling only selective flags to reduce memory
  overhead and performance impact.


*** Developer Tips & Advanced Options
OpenBSD malloc’s defensive features can guide developers and improve code
quality:

- **Fuzzing & testing:** Guard Pages, junk filling, and redzones make memory
  bugs detectable early, improving fuzzing results.
- **Integration with ASLR:** mmap-based allocations are highly randomized, making
  heap exploits difficult.
- **Fail-fast behavior:** Errors like double frees or metadata corruption result in
  process aborts, allowing developers to reproduce bugs deterministically.
- **Memory footprint:** Defensive features increase memory usage; consider this
  in memory-constrained environments.
- **Debug vs. release builds:** Developers often enable maximum security options
  during development and limit them in production for performance.

*** Comparison with other allocators
| Feature / Allocator       | OpenBSD malloc (otto) | glibc malloc           | jemalloc / tcmalloc       |
|---------------------------+---------------------+-----------------------+--------------------------|
| Heap source               | mmap only           | mixed sbrk/mmap       | custom arenas, mostly mmap |
| Metadata location         | out-of-band         | in-band (typical)     | in-band                   |
| Randomization             | high                | limited or optional   | varies                    |
| Guard pages               | optional via config | rarely default        | rarely default            |
| Use-after-free detection  | strong (junk+unmap) | limited               | limited                   |
| Overflow detection        | canaries+guard opt  | depends on debug mode | not default               |
| Failure mode              | abort on inconsistency | undefined/continuing | undefined/continuing      |
| Performance priority      | safety > speed      | speed                 | speed and fragmentation   |
| Default security posture  | hardened by design  | performance-oriented  | performance-oriented      |

*** Why OpenBSD malloc stands out
OpenBSD’s malloc is not simply a defensive allocator; it is a reflection of the
project’s development philosophy:

- Bugs should be caught early and loudly.
- Small implementation, understandable design.
- Security features should be on by default.
- Memory safety belongs at the system level, not only in tools.

This design makes many heap-corruption exploits impractical and forces common
programming mistakes into the open, where developers can fix them.

*** Conclusion
OpenBSD’s malloc may be invisible to most users, but it represents one of the
project’s most impressive engineering achievements. By combining mmap-only
allocations, randomization, guard pages, out-of-band metadata, and strict
fail-fast behavior, it delivers a level of robustness and security rarely found
in a general-purpose operating system.

If memory safety matters to you—and it should—OpenBSD’s malloc is worth knowing
and appreciating. It is a quiet guardian, hardening software in ways that few
users ever see.

*** References / Sources
- [[https://man.openbsd.org/OpenBSD-6.5/malloc][OpenBSD malloc manual]]
- [[https://man.openbsd.org/OpenBSD-5.6/malloc.conf.5][malloc.conf documentation]]
- [[https://www.openbsd.org/papers/eurobsdcon2023-otto-malloc.pdf][Otto Moerbeek’s malloc design talk]]
- [[https://isopenbsdsecu.re/mitigations/malloc/][Summary of OpenBSD malloc evolution]]
- [[https://why-openbsd.rocks/fact/malloc-randomization/][Why OpenBSD Rocks: malloc randomization overview]]
- [[https://www.openbsd.org/faq/faq15.html][OpenBSD Security FAQ: Heap Security]]


